[
  {
    "id": "wiki-summary-Guided_by_Voices",
    "title": "Guided by Voices",
    "text": "Guided by Voices is an American indie rock band formed in 1983 in Dayton, Ohio. The band had a variety of lineup changes, with singer and songwriter Robert Pollard remaining the group's sole constant. The most well-known lineup of the band consisted of Pollard, his brother Jim, Mitch Mitchell, Tobin Sprout, Kevin Fennell (drums), and bassist Greg Demos.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-0",
    "title": "Guided by Voices: History (part 1)",
    "text": "This section needs additional citations for verification. Please help improve this article by adding citations to reliable sourcesin this section. Unsourced material may be challenged and removed. (February 2021) (Learn how and when to remove this message) Formation and early years (1983–1991) Formed in Dayton, Ohio, in the early 1980s, Guided by Voices began their career as a bar band working the local scene. As lineups and day-jobs shifted, however, Pollard moved the band towards a studio-only orientation. Guided by Voices' recording career began with a stream of self-financed, independent releases beginning with the R.E.M.-inspired E.P. Forever Since Breakfast and followed by the albums Devil Between My Toes, Sandbox, Self-Inflicted Aerial Nostalgia, and Same Place The Fly Got Smashed. With only a few hundred copies of each album being pressed, these tended to circulate only among the band members' family and friends. Lo-fi era (1992–1996) With the release of the ultra-limited album Propeller in 1992 (of which only 500 copies were pressed, each with a unique, handmade cover), Guided by Voices for the first time gained some recognition outside of their hometown. This was due in part to gaining fans in the college rock circuit and bands such as Sonic Youth, R.E.M. and The Breeders. New York City and Philadelphia were host to Guided by Voices' return to the live stage (and first shows outside of Ohio) in 1993. At this time, the always-fluid Guided by Voices lineup coalesced a",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-1",
    "title": "Guided by Voices: History (part 2)",
    "text": "round the core of Pollard, guitarists Tobin Sprout and Mitch Mitchell (not to be confused with Jimi Hendrix's drummer), bassist Greg Demos, and drummer Kevin Fennell. Sprout, who was briefly featured in an early-'80s version of the band, had re-joined circa Propeller and soon became Pollard's primary musical foil, in addition to contributing several of his own songs to the band's catalog. 1993 also saw the release of Vampire on Titus, as well as the Fast Japanese Spin Cycle and Static Airplane Jive EPs. Over the next year, the band began to receive national media exposure from sources such as Spin magazine. In 1994, after culling both new songs and reams of archival recordings from GBV's history, Pollard delivered the indie landmark Bee Thousand via Scat Records, with a distribution deal through indie label Matador Records. Soon, the band officially signed with Matador, concurrent with Pollard and his bandmates finally retiring from their day jobs to work in music full-time. The band surprised early audiences accustomed to the generally shambling, lo-fi and collage-like quality of the records with their energetic live show, featuring Pollard's homegrown rock theatrics (consisting of karate-kicks, leaps, Roger Daltrey-inspired mic-twirling, later beer can throwing at rival bands), Mitch Mitchell's windmilling and chain smoking, sometime bassist Greg Demos' striped pants, a never-ending barrage of tunes that all seemed to clock in under 90 seconds, and prodigious alcohol consum",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-2",
    "title": "Guided by Voices: History (part 3)",
    "text": "ption all around. Their true Matador debut came in 1995 with Alien Lanes, which, despite a five-figure recording allowance, was constructed out of home-recorded snippets on the cheap. The band's underground following continued to grow, with notices coming from mainstream sources such as MTV and Rolling Stone. After sessions for a concept album entitled The Power of Suck were aborted, the band assembled Under the Bushes Under the Stars out of their first 24-track studio sessions, recorded with Kim Deal and Steve Albini among others, in 1996. However, the strain of heavy touring would ultimately lead to the demise of the \"classic lineup\", with Sprout deciding to retire from the road in order to focus on raising his first child, his painting, and his solo musical career. Sprout and Pollard marked the occasion by releasing simultaneous solo albums on the same day in 1996: Sprout's Carnival Boy and Pollard's Not in My Airforce, with each making a guest appearance on the other's album. Pollard maintained an active, parallel solo and side project career alongside GBV releases for the remainder of that band's existence. Major label records (1997–2001) Pollard formed a new incarnation of Guided by Voices with members of Cleveland group Cobra Verde in 1997. The following album Mag Earwhig!, combined a new hard-rocking swagger with classic lo-fi fragments and one track, \"Jane of the Waking Universe\", that featured the classic lineup for one last time. However, after another year of rigo",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-3",
    "title": "Guided by Voices: History (part 4)",
    "text": "rous touring, the \"Guided by Verde\" lineup split in late 1997 following Pollard's announcement in an interview that he intended to work with other musicians on the next Guided by Voices project. Cobra Verde's Doug Gillard was tapped for yet another new Guided by Voices lineup in 1998, which also included \"classic\"-era bassist Greg Demos, former Breeders drummer Jim Macpherson, and eventually, former Amps/Breeders guitarist Nate Farley. Departing from Matador, this lineup (without Farley) worked with producer Ric Ocasek to create what was intended to be Guided by Voices' major label debut. Initially produced for Capitol Records, Do the Collapse was repeatedly delayed and finally released in mid-1999 on pseudo-indie label TVT. (In the UK it was released on Creation Records). Featuring a slick, heavily processed sound previously foreign to GBV albums, Do the Collapse failed to garner radio airplay, and was for the most part greeted with mixed reviews. Through touring heavily throughout 1999 and 2000, Guided by Voices' live act became legendary, with shows often stretching past the three-hour mark, and populated by an endless stream of new and classic songs, Pollard solo tracks, impromptu covers of The Who, David Bowie and The Rolling Stones, all accompanied by continuous alcohol consumption. In addition to multiple swings through the United States and Europe, 2000 saw the band's first and only visits to Australia, New Zealand, and Japan. 2000 was capped with the release of the m",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-4",
    "title": "Guided by Voices: History (part 5)",
    "text": "assive Suitcase, a four-disc, 100-song trawl through three decades worth of Pollard's enormous reserve of unreleased material. (Three more box sets of unreleased songs, Suitcase 2, Suitcase 3 and Suitcase 4 released in October 2005, November 2009 and November 2015 respectively.) 2001's Isolation Drills was recorded with Rob Schnapf, who aimed to capture the band's live sound more closely than did Ocasek. Though the album debuted in Billboards top 200 and received higher critical notices than its predecessor, it did not achieve the sought-after radio breakthrough. Later years (2002–2004) After departing from TVT in 2002, Guided by Voices returned to Matador and released Universal Truths and Cycles, a departure from the previous two radio-aspiring albums, and a return to the band's mid-90s, mid-fi aesthetic. Universal Truths producer Todd Tobias would also record the band's final two albums for Matador. 2003 saw the release of the prog-styled Earthquake Glue, followed by the anthology box set Hardcore UFOs: Revelations, Epiphanies and Fast Food in the Western Hemisphere and the greatest hits compilation Best of Guided by Voices: Human Amusements at Hourly Rates. In 2004, Pollard announced he was disbanding Guided by Voices following the release of the Half Smiles of the Decomposed LP, and a final farewell tour. Pollard stated: \"This feels like the last album for Guided by Voices. I've always said that when I make a record that I'm totally satisfied with as befitting a final alb",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-5",
    "title": "Guided by Voices: History (part 6)",
    "text": "um, then that will be it. And this is it.\" On November 9, 2004, Guided by Voices performed on the stage of Austin City Limits, broadcast by PBS on January 22, 2005. Their last television appearance was on Late Night with Conan O'Brien on December 2, 2004. They played the single, \"Everybody Thinks I'm a Raincloud (When I'm Not Looking)\". After a select round of final US shows, Guided by Voices played their final show at The Metro in Chicago on December 31, 2004. The four-hour, 63-song marathon finale is documented on the DVD The Electrifying Conclusion. Post-GBV (2005–2009) Lead singer and principal songwriter Robert Pollard in 2006 Pollard released his first post-GBV album in 2006 on Merge Records. The album, titled From a Compound Eye was a double LP produced by Todd Tobias. Later Pollard albums have been released on Merge and Pollard's own label, Guided by Voices Inc. The GBV song \"Everyone Thinks I'm a Raincloud (When I'm Not Looking)\" was featured in the soundtrack for MLB 2K6. Following GBV's demise, Pollard was frequently asked about band reunions. In 2007 he told MAGNET: \"To me, it's just cashing in. If you're gonna get the band back together, it should be to support a new record, not just to play the hits. That's like doing the county-fair circuit. I don't see Guided By Voices reforming. For one thing, there were 50 or 60 people in Guided By Voices over time.\" Pollard also commented on the fact that GBV and his solo output are basically the same, when he told Harp mag",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-6",
    "title": "Guided by Voices: History (part 7)",
    "text": "azine, in 2005, \"You know, a lot of people try to distinguish things between what is Robert Pollard and what is Guided By Voices. I tell them basically that there is no difference; I am Robert Pollard and I am Guided By Voices.\" In 2008, Pollard admitted to almost bringing GBV back for his album Robert Pollard Is Off to Business but decided against it, instead forming a new label titled Guided by Voices Inc. The 1998–1999 lineup of the band reunited for a few songs, for Pollard's 50th birthday in 2007. In October 2008, it was announced that Guided by Voices' music would be used for a 3-D film musical based on the life of Cleopatra to be directed by Steven Soderbergh with script by James Greer. Soderbergh and Greer would rewrite the lyrics of the songs to fit the story. Soderbergh had previously used a Guided by Voices song in his film Full Frontal, and wrote an introduction to a book on the band. Pollard wrote the soundtrack to Soderbergh's film Bubble, and that music was released as Music for 'Bubble'. Guided by Voices and Pollard posters, t-shirts, and songs appeared frequently on British sit-com The IT Crowd. Reunion (2010–2014) In June 2010, Matador Records announced that the \"Classic '93–'96 Lineup\" would reunite to perform at the label's 21st Anniversary celebration in Las Vegas, in October of that year. A full reunion tour was subsequently announced, with the band selling out nearly every date. The tour included stops at Hoboken's Maxwell's and the Southgate House in N",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-7",
    "title": "Guided by Voices: History (part 8)",
    "text": "ewport, Kentucky, two venues that the band had built a history with due to legendary shows there in the past. When asked by Spinner if there might ever be another proper GBV record Pollard said \"I've thought about it sometimes but it's a very long shot,\" he says. \"We all kind of do our own thing. I'm not completely eliminating the possibility.\" On September 21, 2011, it was announced that a new GBV album, Let's Go Eat the Factory, had been recorded for release in January 2012. On January 4, 2012, the band performed their single \"The Unsinkable Fats Domino\" on the Late Show with David Letterman to promote Let's Go Eat the Factory. During their performance, bassist Greg Demos fell while attempting a dance move. However, Demos was not seriously injured and the band continued to perform their song. The band canceled what was to have been their first post-reunion show in the UK at the All Tomorrow's Parties 'I'll Be Your Mirror' festival at Alexandra Palace, London, in May 2012 as well as a planned appearance at the Primavera Sound festival in Barcelona. The band's management denied reports that the cancellations were due to them splitting up again and confirmed they were still working on new material. The band released a second post-reformation LP, Class Clown Spots a UFO, on June 12, 2012. Generally regarded by fans as the best of the latter-years' albums, it marked a return in tenor and quality to this line-up's mid-90s heyday. A third, The Bears for Lunch, followed in November",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-8",
    "title": "Guided by Voices: History (part 9)",
    "text": ". GBV began touring again in September 2012 with a 13 show \"Tour of the South\", starting in Dayton, Ohio, on September 8, 2012, which included gigs in Cleveland and Pittsburgh, and stops in North Carolina, Florida, Georgia, New Orleans, Texas (Houston and Austin), Missouri and Kansas, with the final show on September 29, 2012, in St. Louis. Another album, English Little League, was released in 2013. Guided by Voices performing in 2014 In a July 2013 interview with Magnet magazine, Pollard stated that English Little League could be the final GBV album. However, in September, a fifth reunion record, Motivational Jumpsuit, was confirmed for release on Guided by Voices Inc. and Fire Records in February 2014. Drummer Kevin Fennell was replaced by Kevin March for the sixth reunion album, Cool Planet, which was released on May 13, 2014. On September 18, 2014, GBV abruptly released a statement on Facebook that they had once again disbanded. Remaining tour dates were canceled. Second reunion (2016–present) In February 2016, the official Guided by Voices Facebook page announced that GBV has been announced to headline the Sled Island Festival on June 25 and that a \"strikingly fresh Guided By Voices album in the works\", on which Pollard plays all the instruments.non-primary source needed Pollard subsequently confirmed the new lineup for the band which would include returning drummer Kevin March along with newcomers guitarist Bobby Bare Jr., guitarist Nick Mitchell and bassist Mark Shue. ",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-9",
    "title": "Guided by Voices: History (part 10)",
    "text": "After the band's set on July 14, 2016 at the Grog Shop in Cleveland, when the band was expected to return to the stage for an encore, Nick Mitchell was fired in the dressing room next to the stage. Mitchell was replaced by former member Doug Gillard, who subsequently rejoined Guided by Voices permanently later that month. On January 25, 2017, the band announced their first double album August by Cake for release on April 7, 2017, and released a new song, \"Hiking Skin.\" The album was also Robert Pollard's 100th album. On March 10, the band premiered another new song from the upcoming album, \"Dr.Feelgood Falls Off the Ocean\". On June 22, 2017, Guided by Voices announced another new album for 2017, titled How Do You Spell Heaven, which was released on August 11. The band also released a new single from the upcoming album Just to Show You. Guided By Voices performing at Tellus 360 in Lancaster, PA, October 8, 2021 On December 8 of the same year, the band announced another album to be released the following March entitled Space Gun, and released the title track as a single. In 2018, Guided by Voices announced the future release of the double album Zeppelin Over China and Warp and Woof for 2019. They also made their 7\" single, \"You Own the Night\" available for pre-order containing singles from both albums. In 2019, the band released Zeppelin Over China, Warp and Woof and Sweating the Plague and in 2020 went on to release three more albums, Surrender Your Poppy Field, Mirrored Aztec",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-History-10",
    "title": "Guided by Voices: History (part 11)",
    "text": " and Styles We Paid For. In 2021, the band released Earth Man Blues in April 2021, It's Not Them. It Couldn't Be Them. It Is Them! in October 2021, and Crystal Nuns Cathedral, which was released on March 4, 2022. Tremblers and Goggles by Rank and the compilation Scalping the Guru rounded out 2022, followed by La La Land, Welshpool Frillies, and Nowhere to Go but Up in 2023. Strut of Kings was announced in April 2024 and released in June. Then, In November 2024, they announced another album titled Universe Room. It would be released on February 7th, 2025. Their 44th album, Thick Rich and Delicious, was released in October 2025. Pollard told an interviewer the band would not tour in support of the album, having decided to stop playing live: \"I feel too old to get onstage.\"",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-Musical style",
    "title": "Guided by Voices: Musical style",
    "text": "Guided by Voices have been categorized as indie rock, alternative rock and lofi, with compositions that Mark Deming of AllMusic said were \"infectiously brief pop songs\". The band's early releases were described as \"amateur recordings that included audible mistakes, eclectic instrumentation, and haphazard songwriting\". The band is influenced by the stylings of the British Invasion and progressive rock.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-Band members",
    "title": "Guided by Voices: Band members",
    "text": "It's been said over fifty musicians have contributed to the band. The following is a list of all known members. Current Robert Pollard – lead vocals (1983–2004, 2010–2014, 2016–present), guitar (1983–1992) Doug Gillard – guitar, backing vocals (1997–2004, 2016–present) Kevin March – drums, backing vocals (2002–2004, 2014, 2016–present) Mark Shue – bass, backing vocals (2016–present) Bobby Bare Jr. – guitar, backing vocals (2016–present) Former Jim Pollard – guitar, bass (1983–1995, 2012) Mitch Mitchell – guitar (1983–1997, 2010–2014), bass (1983–1987) Tobin Sprout – guitar, vocals (1986–1997, 2010–2014) Kevin Fennell – drums (1983–1989, 1993–1997, 2010–2014) Greg Demos – bass (1990–1992, 1994–2000, 2010–2014) Paul Comstock – guitar (1983) Ed John – guitar (1984) Mitch Swann – guitar (1986) Don Thrasher – drums (1989–1992) Steve Wilbur – bass, guitar (1987–1989) Dan Toohey – bass (1991–1994) James Greer – bass,(1994–1996) Bruce \"Smitty\" Smith – drums (1983, 1989) Dave Swanson – drums (1997–1998) Jim Macpherson – drums (1998–2001) Jon McCann – drums (2001–2002) Nate Farley – guitar (1998–2004) Tim Tobias – bass (2000–2003) Chris Slusarenko – bass (2003–2004) Nick Mitchell – guitar, vocals (2016) John Petkovic – guitar (1997–1998) Don Depew – bass (1997–1998) Larry Keller – drums (1994–1995) Craig \"Craig-O\" Nichols – drums (1995) Nick Schuld – bass (1997) Peyton Eric – drums (1986, 1989) Joe Buben – drums (1996) Leland Cain – bass (1996) Former touring members Matt Sweeney – bass (1996) Sam Powers – bass (2003) Timeline",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-Discography",
    "title": "Guided by Voices: Discography",
    "text": "Main article: Guided by Voices discography Devil Between My Toes (1987) Sandbox (1987) Self-Inflicted Aerial Nostalgia (1989) Same Place the Fly Got Smashed (1990) Propeller (1992) Vampire on Titus (1993) Bee Thousand (1994) Alien Lanes (1995) Under the Bushes Under the Stars (1996) Tonics Twisted Chasers (1996) Mag Earwhig! (1997) Do the Collapse (1999) Isolation Drills (2001) Universal Truths and Cycles (2002) Earthquake Glue (2003) Half Smiles of the Decomposed (2004) Let's Go Eat the Factory (2012) Class Clown Spots a UFO (2012) The Bears for Lunch (2012) English Little League (2013) Motivational Jumpsuit (2014) Cool Planet (2014) Please Be Honest (2016) August by Cake (2017) How Do You Spell Heaven (2017) Space Gun (2018) Zeppelin Over China (2019) Warp and Woof (2019) Sweating the Plague (2019) Surrender Your Poppy Field (2020) Mirrored Aztec (2020) Styles We Paid For (2020) Earth Man Blues (2021) It's Not Them. It Couldn't Be Them. It Is Them! (2021) Crystal Nuns Cathedral (2022) Tremblers and Goggles by Rank (2022) La La Land (2023) Welshpool Frillies (2023) Nowhere to Go but Up (2023) Strut of Kings (2024) Universe Room (2025) Thick Rich and Delicious (2025)",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-References-0",
    "title": "Guided by Voices: References (part 1)",
    "text": "^ Adjei-Kontoh, Hubert (May 4, 2021). \"Earth Man Blues\". Pitchfork. Retrieved February 6, 2023. ^ Archived at Ghostarchive and the Wayback Machine: \"Bob Pollard throwing empty beer can at band\". YouTube. July 11, 2010. Retrieved November 7, 2017. ^ McGonigal, Mike (Summer 2001). \"Robert Pollard\". BOMB (76). New Art Publications: 32–37. ^ \"Special Announcement From Guided By Voices\". Gbv.com. Archived from the original on March 15, 2012. Retrieved November 17, 2012. ^ \"The Electrifying Conclusion\". Gbvdb.com. January 15, 1994. Retrieved November 17, 2012. ^ \"Magnetmagazine.com\". Archived from the original on August 27, 2008. Retrieved August 21, 2020. ^ \"Harp Times – Get the latest information and the best ideas just for you\". Harp Times. Archived from the original on September 17, 2008. Retrieved August 21, 2020. ^ \"Robert Pollard Returns to Serious Business\". Billboard. May 7, 2008. Retrieved November 17, 2012. ^ Fleming, Michael; Keslassy, Elsa (October 23, 2008), \"Soderbergh to make 3-D 'Cleopatra'\", Variety, archived from the original on December 23, 2008 ^ Tobias, Scott (January 6, 2009), \"Steven Soderbergh\", The Onion (A.V. Club) ^ a b Olsen, Mark (January 29, 2006), \"The Indie Boy in the Soundtrack Bubble\", The New York Times ^ \"Matador 21 in Las Vegas\". Matadorrecords.com. June 29, 2010. Archived from the original on October 30, 2012. Retrieved November 17, 2012. ^ \"Guided By Voices Reunion Tour Dates Announced\". Buzzgrinder.com. July 15, 2010. Archived from the origi",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-References-1",
    "title": "Guided by Voices: References (part 2)",
    "text": "nal on September 30, 2011. Retrieved December 20, 2011. ^ \"Guided by Voices' Robert Pollard Won't 'Eliminate' Possibility of New Album\". Spinner. December 23, 2010. Archived from the original on August 6, 2012. Retrieved December 20, 2011. ^ \"Guided By Voices Releasing New Album, Let's Go Eat the Factory\". Buzzgrinder.com. September 21, 2011. Archived from the original on January 20, 2012. Retrieved December 20, 2011. ^ \"I'll Be Your Mirror London 2012 curated by Mogwai ATP— All Tomorrow's Parties\". Atpfestival.com. Retrieved December 20, 2011. ^ Phillips, Amy (December 7, 2011). \"The Afghan Whigs to Reunite for ATP\". Pitchfork. Retrieved December 20, 2011. ^ Exclaim, \"Guided By Voices Reveal Release Details for 'Class Clown Spots a UFO,' Announce Yet Another New Album\", April 18, 2012. Retrieved April 18, 2012. ^ Gold, Adam (July 27, 2012). \"Guided by Voices Ready Third New Album of 2012\". Rolling Stone. Retrieved December 3, 2012. ^ \"– Curated News, Gossip, Concert Reviews, Fearless Political Commentary, Interviews....Plus, the Usual Sex, Drugs and Rock n' Roll» Blog Archive» EXCERPT: In Bob We Trust\". Phawker.com. July 3, 2013. Retrieved September 30, 2013. ^ \"Album Review: Guided by Voices – Motivational Jumpsuit (Lo-fi Rock)\". Still in Rock. March 2014. Retrieved September 8, 2015. ^ \"Guided By Voices Declare 'Bad Love Is Easy to Do' on 'Cool Planet' Duet / Prolific indie-rock royals prep yet another LP for May 13\". Spin. March 4, 2014. Retrieved March 25, 2014. ^ \"Guide",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-References-2",
    "title": "Guided by Voices: References (part 3)",
    "text": "d By Voices' New Album 'Cool Planet' Due Out 19 May 2014\". Contactmusic.com. March 5, 2014. Retrieved September 8, 2015. ^ Grow, Kory (September 18, 2014). \"Guided by Voices Break Up, Cancel Tour\". Rolling Stone. Retrieved September 8, 2015. ^ \"Security Check Required\". Facebook.com. Retrieved April 22, 2016. ^ Minsker, Evan (February 9, 2016). \"Guided By Voices Are Back in Action\". Pitchfork. Retrieved February 9, 2016. ^ Vanderbilt, Mike (July 16, 2016). \"A Guided By Voices reunion within the Guided By Voices reunion happened last night\". The AV Club. Retrieved July 16, 2016. ^ Vanderbilt, Mike (July 26, 2016). \"Doug Gillard officially rejoins Guided By Voices, immediately forms side project\". The A.V. Club. Retrieved July 28, 2016. ^ Sodomsky, Sam (January 25, 2017). \"Guided by Voices' New Album Is Robert Pollard's 100th LP\". Pitchfork. Retrieved March 23, 2017. ^ Anthony, David (March 10, 2017). \"\"Dr. Feelgood Falls Off The Ocean\" on Guided By Voices' upcoming double album\". The A.V. Club. Retrieved March 23, 2017. ^ Geslani, Michelle (June 22, 2017). \"Guided By Voices announce new album, How Do You Spell Heaven, share \"Just to Show You\" — listen\". Consequence of Sound. Retrieved June 25, 2017. ^ Schatz, Lake (December 8, 2017). \"Guided By Voices announce new album, Space Gun, share the title track\". Consequence of Sound. Retrieved December 8, 2017. ^ \"Shop\". Factory of Raw Essentials. Archived from the original on July 1, 2018. Retrieved June 30, 2018. ^ \"Guided by Voice",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-References-3",
    "title": "Guided by Voices: References (part 4)",
    "text": "s announce new album, 'Earth Man Blues'\". NME. February 23, 2021. ^ \"Guided by Voices announce 34th album, 'It's Not Them. It Couldn't be Them. It is Them!'\". NME. October 19, 2021. ^ \"Guided By Voices Announce 35th Album 'Crystal Nuns Cathedral' Out 3/4\". Glidemagazine.com. January 5, 2022. Retrieved March 4, 2022. ^ Gregory, Allie (October 11, 2023). \"Guided by Voices Announce New Album 'Nowhere to Go but Up'\". Exclaim!. Retrieved October 11, 2023. ^ Lapierre, Megan (April 16, 2024). \"Guided by Voices Announce 'Strut of Kings,' Their Only Album of 2024\". Exclaim!. ISSN1207-6600. Retrieved April 16, 2024. ^ \"Guided By Voices Announce 42nd Album 'Thick, Rich And Delicious': Hear \"(You Can't Go Back To) Oxford Talawanda\"\". Stereogum. September 4, 2025. Retrieved November 12, 2025. ^ Miller, Eric T. (December 19, 2025). \"Best of 2025: A Conversation With Robert Pollard (Guided By Voices)\". Magnet. Retrieved December 20, 2025. ^ Covach, John; Flory, Andrew (July 1, 2022). What's That Sound?: An Introduction to Rock and Its History (Sixthed.). W. W. Norton Company. p.487. ^ Deming, Mark. \"Guided by Voices Songs, Albums, Reviews, Bio \". AllMusic. ^ \"Guided By Voices – The Vogue\". Retrieved March 22, 2021. ^ \"Guided By Voices: Don't give up the day job\". the Guardian. January 5, 2012. Retrieved March 22, 2021. ^ \"GBVDB – Guided By Voices Database\". www.gbvdb.com. Retrieved March 22, 2021. ^ \"GBVDB Database credits Jim Greer for playing this song\". Retrieved December 8, 2017. ^ wrot",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-References-4",
    "title": "Guided by Voices: References (part 5)",
    "text": "e and played on the song \"Trendspotter Acrobat\" on the album Sunfish Holy Breakfast ^ \"Guided By Voices – \"Volcano\"\". Stereogum.com. January 7, 2020. Retrieved January 7, 2020. ^ \"Mirrored Aztec Guided By Voices\". GBVDB.com. ^ Ehrlich, Brenna (July 23, 2020). \"Guided By Voices' Robert Pollard Talks Record-Breaking Livestream, (Another) New Album\". Rollingstone.com. Retrieved August 21, 2020. ^ Blistein, Jon (January 5, 2022). \"Guided by Voices Bring Big Power-Pop Energy on New Song 'Excited Ones'\". Rolling Stone. Retrieved January 5, 2022. ^ Ehrlich, Brenna (May 3, 2022). \"Guided by Voices Fatten Their Epic Setlists With Second Album of 2022\". Rolling Stone.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-Further reading",
    "title": "Guided by Voices: Further reading",
    "text": "Warren, Jeff. \"Guided By Voices Database\". Retrieved August 17, 2019. Woodworth, Marc (2006). Guided By Voices' Bee Thousand. 33⅓. Vol.38. New York, NY: Continuum International Publishing. ISBN978-1-4411-1527-0. OCLC905462274. Guided by Voices: A Brief History — Twenty-One Years of Hunting Accidents in The Forests of Rock and Roll Written by James Greer and published by Grove/Atlantic in 2005, this is the first biography of GBV authorized by the band. Steven Soderbergh wrote the foreword. Author Jim Greer, a former editor of Spin magazine, was also a member of the band from 1994 to 1996 (he wrote the song \"Trendspotter Acrobat\" on Sunfish Holy Breakfast). Cutter, Matthew (2018). Closer You Are: The Story of Robert Pollard and Guided by Voices. New York, NY: Da Capo. ISBN978-0-306-82577-4. OCLC1048922765. Gomez, Jeff (2020). Zeppelin Over Dayton: Guided By Voices Album By Album. Jawbone. ISBN978-1911036593.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-External links-0",
    "title": "Guided by Voices: External links (part 1)",
    "text": "Wikimedia Commons has media related to Guided by Voices. Official website Guided by Voices at Matador Records Guided by Voices Database – searchable discographic website vteGuided by Voices Robert Pollard Doug Gillard Mark Shue Bobby Bare Jr. Kevin March Tobin Sprout Greg Demos Kevin Fennell Jim Macpherson James Greer Discography Studio albums Devil Between My Toes (1987) Sandbox (1987) Self-Inflicted Aerial Nostalgia (1989) Same Place the Fly Got Smashed (1990) Propeller (1992) Vampire on Titus (1993) Bee Thousand (1994) Alien Lanes (1995) Under the Bushes Under the Stars (1996) Tonics Twisted Chasers (1996) Mag Earwhig! (1997) Do the Collapse (1999) Isolation Drills (2001) Universal Truths and Cycles (2002) Earthquake Glue (2003) Half Smiles of the Decomposed (2004) Let's Go Eat the Factory (2012) Class Clown Spots a UFO (2012) The Bears for Lunch (2012) English Little League (2013) Motivational Jumpsuit (2014) Cool Planet (2014) Please Be Honest (2016) August by Cake (2017) How Do You Spell Heaven (2017) Space Gun (2018) Zeppelin Over China (2019) Warp and Woof (2019) Sweating the Plague (2019) Surrender Your Poppy Field (2020) Mirrored Aztec (2020) Styles We Paid For (2020) Earth Man Blues (2021) It's Not Them. It Couldn't Be Them. It Is Them! (2021) Crystal Nuns Cathedral (2022) Tremblers and Goggles by Rank (2022) La La Land (2023) Welshpool Frillies (2023) Nowhere to Go but Up (2023) Strut of Kings (2024) Universe Room (2025) Thick Rich and Delicious (2025) EPs Forever",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-External links-1",
    "title": "Guided by Voices: External links (part 2)",
    "text": " Since Breakfast (1986) The Grand Hour (1993) Static Airplane Jive (1993) Get Out of My Stations (1994) Fast Japanese Spin Cycle (1994) Clown Prince of the Menthol Trailer (1994) I Am a Scientist (1994) Tigerbomb (1995) Sunfish Holy Breakfast (1996) Plantations of Pale Pink (1996) Wish in One Hand... (1997) Plugs for the Program (1999) Hold on Hope (2000) Dayton, Ohio–19 Something and 5 (2000) The Pipe Dreams of Instant Prince Whippet (2002) Down by the Racetrack (2013) Live albumsLive from Austin, TX (2007)Compilation albums The Best of Guided by Voices: Human Amusements at Hourly Rates (2003) Crickets: Best of the Fading Captain Series 1999–2007 (2007) Scalping the Guru (2022) Box sets Box (1995) Suitcase: Failed Experiments and Trashed Aircraft (2000) Hardcore UFOs: Revelations, Epiphanies and Fast Food in the Western Hemisphere (2003) Suitcase 2: American Superdream Wow (2005) Suitcase 3: Up We Go Now (2009) Suitcase 4: Captain Kangaroo Won the War (2015) Category vteRobert PollardSolo albums Not in My Airforce (1996) Waved Out (1998) Kid Marine (1999) In Shop We Build Electric Chairs: Professional Music by Nightwalker 1984–1993 (1999, as Nightwalker) Motel of Fools (2003) Fiction Man (2004) Relaxation of the Asshole (2005) From a Compound Eye (2006) Normal Happiness (2006) Silverfish Trivia (2007) Standard Gargoyle Decisions (2007) Coast to Coast Carpet of Love (2007) Superman Was a Rocker (2008) Weatherman and Skin Goddess (2008) Robert Pollard Is Off to Business (2008)",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-External links-2",
    "title": "Guided by Voices: External links (part 3)",
    "text": " The Crawling Distance (2009) Elephant Jokes (2009) We All Got Out of the Army (2010) Moses on a Snail (2010) Space City Kicks (2011) Lord of the Birdcage (2011) Mouseman Cloud (2012) Jack Sells the Cow (2012) Honey Locust Honky Tonk (2013) Blazing Gentlemen (2013) Faulty Superheroes (2015) Of Course You Are (2016) Collaboration albums Big Trouble (2000) Choreographed Man of War (2001) Calling Zero (2002) Blues and Boogie Shoes (2006) With Doug Gillard Speak Kindly of Your Volunteer Fire Department (1999) Mist King Urth (2003) Waving at the Astronauts (2011; as Lifeguards) Airport 5 albums Tower in the Fountain of Sparks (2001) Life Starts Here (2002) Teenage Guitar albums Force Fields At Home (2013) More Lies From The Gooseberry Bush (2014) Related artists Guided by Voices Circus Devils Boston Spaceships vteTobin SproutSolo albums Carnival Boy (1996) Moonflower Plastic (1997) Let's Welcome the Circus People (1999) Lost Planets Phantom Voices (2003) The Bluebirds of Happiness Tried to Land on My Shoulder (2010) The Universe Me (2017) Airport 5 albums Tower in the Fountain of Sparks (2001) Life Starts Here (2002) Related artists Guided by Voices Authority control databases InternationalISNIVIAFGNDNationalUnited StatesFranceBnF dataNorwayArtistsMusicBrainzOtherYale LUX ^ a b c \"Guided By Voices: A Brief History: Twenty-One Years Of Hunting Accidents In The Forests Of Rock And Roll (By James Greer)\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Jim Greer\". Gbvdb.com. Retrieved Sep",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-Guided_by_Voices-External links-3",
    "title": "Guided by Voices: External links (part 4)",
    "text": "tember 5, 2008.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices"
  },
  {
    "id": "wiki-summary-Guided_by_Voices_discography",
    "title": "Guided by Voices discography",
    "text": "The Guided by Voices discography includes dozens of releases, both official and unofficial. Robert Pollard, the main creative force behind the band, is a prolific songwriter, having written or co-written more than 1,600 songs, with over 500 of them released under the Guided by Voices moniker.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Studio albums-0",
    "title": "Guided by Voices discography: Studio albums (part 1)",
    "text": "Year Number Album details Peak chart positions US USHeat. USIndie 1987 1 Devil Between My Toes Released: February 15, 1987 Label: Schwa (GBV0001) Format: LP — — — 2 Sandbox Released: 1987 Label: Halo (#1) Format: LP — — — 1989 3 Self-Inflicted Aerial Nostalgia Released: 1989 Label: Halo (#2) Format: LP — — — 1990 4 Same Place the Fly Got Smashed Released: 1990 Label: Rocket #9 (OX846) Format: LP — — — 1992 5 Propeller Released: 1992 Label: Rockathon (#001) Format: LP — — — 1993 6 Vampire on Titus Released: 1993 Label: Scat (#31) Format: LP — — — 1994 7 Bee Thousand Released: June 21, 1994 Label: Scat Records (#35) Format: LP, Cassette, CD — — — 1995 8 Alien Lanes Released: April 4, 1995 Label: Matador (OLE 123) Format: LP, Cassette, CD — — — 1996 9 Under the Bushes Under the Stars Released: March 26, 1996 Label: Matador (OLE 161) Format: LP + 12-inch, Cassette, CD — 19 — 10 Tonics Twisted Chasers Released: 1996 Label: Rockathon (#002) Format: LP — — — 1997 11 Mag Earwhig! Released: May 20, 1997 Label: Matador (OLE 241) Format: LP, Cassette, CD — 19 — 1999 12 Do the Collapse Released: August 3, 1999 Label: TVT (TVT-1980) Format: LP, Cassette, CD — 14 — 2001 13 Isolation Drills Released: April 10, 2001 Label: TVT (TVT 2160) Format: LP, CD 168 8 6 2002 14 Universal Truths and Cycles Released: June 18, 2002 Label: Matador (OLE 547) Format: LP, CD 160 3 10 2003 15 Earthquake Glue Released: August 19, 2003 Label: Matador (OLE 574) Format: LP, CD 193 12 8 2004 16 Half Smiles of the ",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Studio albums-1",
    "title": "Guided by Voices discography: Studio albums (part 2)",
    "text": "Decomposed Released: August 24, 2004 Label: Matador (OLE 612) Format: LP, CD — 16 22 2012 17 Let's Go Eat the Factory Released: January 1, 2012 Label: Guided by Voices Inc. (GBVI-16), Fire Records (FIRECD/LP248) Format: LP, CD, Cassette — 8 35 18 Class Clown Spots a UFO Released: June 11, 2012 Label: Guided by Voices Inc. (GBVI-22), Fire Records (FIRECD/LP249) Format: LP, CD, Cassette — 12 — 19 The Bears for Lunch Released: November 13, 2012 Label: Guided by Voices Inc. (GBVI-27), Fire Records (FIRECD/LP259) Format: LP, CD, Cassette — 9 — 2013 20 English Little League Released: April 30, 2013 Label: Guided by Voices Inc. (GBVI-34), Fire Records (FIRECD/LP294) Format: LP, CD, Cassette — 21 — 2014 21 Motivational Jumpsuit Released: February 18, 2014 Label: Guided by Voices Inc. (GBVI-45), Fire Records (FIRECD/LP337) Format: LP, CD, Cassette — 18 — 22 Cool Planet Released: May 13, 2014 Label: Guided by Voices Inc. (GBVI-50), Fire Records (FIRECD/LP355) Format: LP, CD, Cassette — 20 — 2016 23 Please Be Honest Released: April 22, 2016 Label: Guided by Voices Inc. Format: LP, CD — — — 2017 24 August by Cake Released: April 7, 2017 Label: Guided by Voices Inc. Format: 2-LP, CD — 22 — 25 How Do You Spell Heaven Released: August 11, 2017 Label: Guided by Voices Inc. Format: LP, CD — 20 37 2018 26 Space Gun Released: March 23, 2018 Label: Guided by Voices Inc. Format: LP, CD — — — 2019 27 Zeppelin Over China Released: February 1, 2019 Label: Guided by Voices Inc. Format: 2-LP, CD — — —",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Studio albums-2",
    "title": "Guided by Voices discography: Studio albums (part 3)",
    "text": " 28 Warp and Woof Released: April 26, 2019 Label: Guided by Voices Inc. Format: LP, CD — — — 29 Sweating the Plague Released: October 25, 2019 Label: Guided by Voices Inc. Format: LP, CD — — — 2020 30 Surrender Your Poppy Field Released: February 20, 2020 Label: Guided by Voices Inc. Format: LP, CD — — — 31 Mirrored Aztec Released: August 21, 2020 Label: Guided by Voices Inc. Format: LP, CD — — — 32 Styles We Paid For Released: December 11, 2020 Label: Guided by Voices Inc. Format: LP, CD — — — 2021 33 Earth Man Blues Released: April 30, 2021 Label: Guided by Voices Inc. Format: LP, CD — — — 34 It's Not Them. It Couldn't Be Them. It Is Them! Released: October 22, 2021 Label: Guided by Voices Inc. Format: LP, CD — — — 2022 35 Crystal Nuns Cathedral Released: March 4, 2022 Label: Guided by Voices Inc. Format: LP, CD — — — 36 Tremblers and Goggles by Rank Released: July 1, 2022 Label: Guided by Voices Inc. Format: LP, CD — — — 2023 37 La La Land Released: January 20, 2023 Label: Guided by Voices Inc. Format: LP, CD — — — 38 Welshpool Frillies Released: July 21, 2023 Label: Guided by Voices Inc. Format: LP, CD — — — 39 Nowhere to Go but Up Released: November 24, 2023 Label: Guided by Voices Inc. Format: LP, CD — — — 2024 40 Strut of Kings Released: June 28, 2024 Label: Guided by Voices Inc./Rockathon Format: LP, CD — — — 2025 41 Universe Room Released: February 7, 2025 Label: Guided by Voices Inc./Rockathon Format: LP, CD — — — 42 Thick, Rich Delicious Scheduled: October 31, 2025",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Studio albums-3",
    "title": "Guided by Voices discography: Studio albums (part 4)",
    "text": " Label: Guided by Voices Inc./Rockathon Format: LP, CD — — —",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Extended plays-0",
    "title": "Guided by Voices discography: Extended plays (part 1)",
    "text": "Year EP details 1986 Forever Since Breakfast Released: 1986 Label: I Wanna (605058X) Format: 12-inch EP 1993 The Grand Hour Released: 1993 Label: Scat (#28) Format: 7-inch EP Static Airplane Jive Released: 1993 Label: City Slang (04939-7) Format: 7-inch EP 1994 Get Out of My Stations Released: 1994 Label: Siltbreeze (SB 028) Format: 7-inch EP Fast Japanese Spin Cycle Released: 1994 Label: Engine (VROOM-07) Format: 7-inch EP, CD Clown Prince of the Menthol Trailer Released: 1994 Label: Domino (RUG 11) Format: 7-inch EP, CD I Am a Scientist Released: October 15, 1994 Label: Scat (#38) Format: 7-inch EP, CD 1995 Tigerbomb Released: November 14, 1995 Label: Matador (OLE 168-7) Format: 7-inch EP 1996 Sunfish Holy Breakfast Released: November 19, 1996 Label: Matador (OLE 185) Format: 12-inch EP, CD Plantations of Pale Pink Released: November 19, 1996 Label: Matador (OLE 208-7) Format: 7-inch EP 1997 Wish in One Hand… Released: 1997 Label: Jass (J001) Format: 7-inch EP 1999 Plugs for the Program Released: December 3, 1999 Label: TVT (TVT 1983-2) Format: CD 2000 Hold on Hope Released: March 7, 2000 Label: TVT (TVT 1985-2) Format: CD Dayton, Ohio – 19 Something and 5 Released: April 2, 2000 Label: Fading Captain Series (#5) Format: 7-inch EP 2001 Daredevil Stamp Collector: Do The Collapse B-sides Released: March 30, 2001 Label: Fading Captain Series (#10) Format: 12-inch EP 2002 The Pipe Dreams of Instant Prince Whippet Released: September 17, 2002 Label: Fading Captain Series (#24) F",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Extended plays-1",
    "title": "Guided by Voices discography: Extended plays (part 2)",
    "text": "ormat: 12-inch EP, CD 2013 Down by the Racetrack Released: January 22, 2013 Label: Guided by Voices Inc. (GBVI-28) Format: 7-inch EP, CD 2018 Wine Cork Stonehenge Released: December 7, 2018 Label: Guided by Voices Inc. Format: 7-inch EP 100 Dougs Released: December 7, 2018 Label: Guided by Voices Inc. Format: 7-inch EP 2019 1901 Acid Rock Released: March 29, 2019 Label: Guided by Voices Inc. Format: 7-inch EP Umlaut Over the Ozone Released: March 29, 2019 Label: Guided by Voices Inc. Format: 7-inch EP Split EPs Year Split Details Songs 1996 Superchunk/Guided by Voices Released: 1996 (Australia) Label: Fellaheen (JACK 046-2) Format: CD Total length: 16:06 Superchunk – \"A Small Definition\" – 4:01 Superchunk – \"Her Royal Fisticuffs\" – 3:37 Superchunk – \"The Mine Has Been Returned to the Original Owner\" – 3:27 Guided by Voices – \"Delayed Reaction Brats\" – 1:07 Guided by Voices – \"He's the Uncle\" – 1:38 Guided by Voices – \"Key Losers\" – 2:16 1997 8 Rounds: GVSB vs GBV Released: July 1, 1997 Label: Radiopaque Recordings (RR013) Format: CD Total length: 24:19 Girls Against Boys – \"Learned It\" – 3:42 Girls Against Boys – \"Vera Cruz\" – 4:31 Girls Against Boys – \"Disco 666\" – 2:43 Girls Against Boys – \"Kill the Sexplayer\" – 3:55 Guided by Voices – \"Unleashed! The Large-Hearted Boy\" [Live] – 1:58 Guided by Voices – \"Motor Away\" [Live] – 2:22 Guided by Voices – \"My Valuable Hunting Knife\" [Live] – 2:08 Guided by Voices – \"Shocker in Gloomtown/Some Drilling Implied\" [Live] – 3:00 2001 Sel",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Extended plays-2",
    "title": "Guided by Voices discography: Extended plays (part 3)",
    "text": "ective Service Released: December 10, 2001 Fading Captain Series (#16) Format: CD Total length: 28:10 Guided by Voices – \"Dayton, Ohio–19 Something and 5\" [Live] – 2:56 Guided by Voices – \"Travels\" – 2:00 Guided by Voices – \"No Welcome Wagons\" – 2:00 Guided by Voices – \"Selective Service\" – 1:54 Airport 5 – \"Total Exposure\" – 4:05 Airport 5 – \"Cold War Water Sports\" – 3:26 Airport 5 – \"The Wheel Hits the Path (Quite Soon)\" – 1:27 Airport 5 – \"Stifled Man Casino\" – 3:18 Airport 5 – \"Peroxide\" – 1:42 Airport 5 – \"Eskimo Clockwork\" – 1:23 Airport 5 – \"In the Brain\" [Bonus track] – 3:59",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Singles-0",
    "title": "Guided by Voices discography: Singles (part 1)",
    "text": "Year Song/Single Details Album 1995 \"Motor Away\" Released: June 6, 1995 Label: Matador (OLE 148-7) Format: 7-inch Single Alien Lanes 1996 \"The Official Ironmen Rally Song\" Released: February 27, 1996 Label: Matador (OLE 184-7/OLE 184-2) Format: 7-inch Single, CD Single Under the Bushes Under the Stars 1996 \"Cut-Out Witch\" Released: June 17, 1996 Label: Matador (OLE 218-7) Format: 7-inch Single (Picture Disc) 1997 \"Bulldog Skin\" Released: May 6, 1997 Label: Matador (OLE 217-7/OLE 217-2) Format: 7-inch Single, CD Single Mag Earwhig! 1997 \"I Am a Tree\" Released: July 29, 1997 Label: Matador (OLE 264-7/OLE 264-2) Format: 7-inch Single, CD Single 1999 \"Surgical Focus\" Released: June 22, 1999 Label: TVT (TVT-1981-7) Format: 7-inch Single Do the Collapse 1999 \"Teenage FBI\" Released: September 28, 1999 Label: Creation (CRES 325/CRESCD 325) Format: 7-inch Single, CD Single 1999 \"Hold on Hope\" Released: November 1, 1999 Label: Creation (CRES 328) Format: 7-inch Single 2001 \"Chasing Heather Crazy\" Released: March 13, 2001 Label: TVT (2162) Format: 7-inch Single Isolation Drills 2001 \"Glad Girls\" Released: July 9, 2001 Label: TVT (020412) Format: 7-inch Single 2002 \"Back to the Lake\" Released: May 21, 2002 Label: Fading Captain Series (#20) / Matador (OLE 564-2) Format: 7-inch Single, CD Single (released August 19, 2002) Universal Truths and Cycles 2002 \"Cheyenne\" Released: May 21, 2002 Label: Fading Captain Series (#21) Format: 7-inch Single 2002 \"Everywhere with Helicopter\" Released: M",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Singles-1",
    "title": "Guided by Voices discography: Singles (part 2)",
    "text": "ay 21, 2002 Label: Fading Captain Series (#22) / Matador (OLE 552-2) Format: 7-inch Single, CD Single (released June 3, 2002) 2002 \"Universal Truths and Cycles\" Released: May 21, 2002 Label: Fading Captain Series (#23) Format: 7-inch Single 2003 \"My Kind of Soldier\" Released: July 29, 2003 Label: Fading Captain Series (#28) Format: 7-inch Single Earthquake Glue 2003 \"The Best of Jill Hives\" Released: September 23, 2003 Label: Matador (OLE 598-2) Format: CD Single 2011 \"We Won't Apologize for the Human Race\" / \"The Unsinkable Fats Domino\" Released: November 22, 2011 Label: Matador (OLE-973-7) Format: 7-inch Single Let's Go Eat the Factory 2011 \"Doughnut for a Snowman\" Released: November 28, 2011 Label: Fire (BLAZE45188) Format: 7-inch Single 2012 \"Chocolate Boy\" Released: January 17, 2012 Label: Guided By Voices Inc. (GBVI-17) Format: 7-inch Single 2012 \"Keep It In Motion\" Released: March 20, 2012 Label: Guided By Voices Inc. (GBVI-18), Fire (BLAZE45190) Format: 7-inch Single Class Clown Spots a UFO 2012 \"Jon The Croc\" Released: April 17, 2012 Label: Guided By Voices Inc. (GBVI-20), Fire (BLAZE45191) Format: 7-inch Single 2012 \"Class Clown Spots a UFO\" Released: May 15, 2012 Label: Guided By Voices Inc. (GBVI-21), Fire (BLAZE45192) Format: 7-inch Single 2012 \"White Flag\" Released: October 29, 2012 Label: Guided By Voices Inc. (GBVI-24), Fire (BLAZE45203) Format: 7-inch Single The Bears for Lunch 2012 \"Everywhere is Miles From Everywhere\" Released: October 29, 2012 Label: Guide",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Singles-2",
    "title": "Guided by Voices discography: Singles (part 3)",
    "text": "d By Voices Inc. (GBVI-25), Fire (BLAZE45202) Format: 7-inch Single 2012 \"Hangover Child\" Released: October 29, 2012 Label: Guided By Voices Inc. (GBVI-26), Fire (BLAZE45201) Format: 7-inch Single 2013 \"Flunky Minnows\" Released: February 19, 2013 Label: Guided By Voices Inc. (GBVI-29) Format: 7-inch Single English Little League 2013 \"Islands (She Talks In Rainbows)\" Released: March 5, 2013 Label: Guided By Voices Inc. (GBVI-30) Format: 7-inch Single 2013 \"Trash Can Full Of Nails\" Released: March 19, 2013 Label: Guided By Voices Inc. (GBVI-31) Format: 7-inch Single 2013 \"Xeno Pariah\" Released: April 2, 2013 Label: Guided By Voices Inc. (GBVI-32) Format: 7-inch Single 2013 \"Noble Insect\" Released: April 16, 2013 Label: Guided By Voices Inc. (GBVI-33) Format: 7-inch Single 2014 \"Save The Company\" Released: January 21, 2014 Label: Guided By Voices Inc. (GBVI-40) Format: 7-inch Single Motivational Jumpsuit 2014 \"Vote For Me Dummy\" Released: January 21, 2014 Label: Guided By Voices Inc. (GBVI-41) Format: 7-inch Single 2014 \"Alex And The Omegas\" Released: January 21, 2014 Label: Guided By Voices Inc. (GBVI-42) Format: 7-inch Single 2014 \"The Littlest League Possible\" / \"Jupiter Spin\" Released: January 21, 2014 Label: Guided By Voices Inc. (GBVI-43) Format: 7-inch Single 2014 \"Planet Score\" / \"Zero Elasticity\" Released: January 21, 2014 Label: Guided By Voices Inc. (GBVI-44) Format: 7-inch Single 2014 \"Authoritarian Zoo\" Released: April 29, 2014 Label: Guided By Voices Inc. (GBVI-46)",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Singles-3",
    "title": "Guided by Voices discography: Singles (part 4)",
    "text": " Format: 7-inch Single Cool Planet 2014 \"Males Of Wormwood Mars\" Released: April 29, 2014 Label: Guided By Voices Inc. (GBVI-47) Format: 7-inch Single 2014 \"Table At Fool’s Tooth\" Released: April 29, 2014 Label: Guided By Voices Inc. (GBVI-48) Format: 7-inch Single 2014 \"All American Boy\" Released: April 29, 2014 Label: Guided By Voices Inc. (GBVI-49) Format: 7-inch Single Split singles Year Split Details Songs 1993 GBV / Jenny Mae Leffel Released: 1993 Label: Anyway (ANYWAY 013) Format: 7-inch Single A1: Guided by Voices – \"If We Wait\" (Robert Pollard) B1: Jenny Mae Leffel – \"Red Chair\" 1994 GBV / Grifters Released: 1994 Label: Now Sound (NOW #2) Format: 7-inch Single A1: Guided by Voices – \"Hey Mr. Soundman\" (R. Pollard, Tobin Sprout) A2: Guided by Voices – \"Announcers and Umpires\" (R. Pollard) A3: Guided by Voices – \"Evil Speaker B\" (Jim Pollard) A4: Guided by Voices – \"Uncle Dave\" (R. Pollard) B1: Grifters – \"I'm Drunk\" (Grifters) 1994 GBV / Belreve Released: 1994 Label: Anyway (ANYWAY 021) Format: 7-inch Single A1: Belreve – \"The Sulk King\" B1: Guided by Voices – \"Always Crush Me\" (R. Pollard) 1995 GBV / New Radiant Storm King Released: 1995 Label: Chunk (CH4520) Format: 7-inch Single A1: Guided by Voices – \"The Opposing Engineer (Sleeps Alone)\" (New Radiant Storm King) B1: New Radiant Storm King – \"I Am a Scientist\" (R. Pollard) 1997 GBV / Cobra Verde Released: March 10, 1997 Label: Wabana (ORE 10) Format: 7-inch Single A1: Guided by Voices – \"Aim Correctly\" (R. Pollard",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Singles-4",
    "title": "Guided by Voices discography: Singles (part 5)",
    "text": ") A2: Guided by Voices – \"Orange Jacket\" (R. Pollard) B1: Cobra Verde – \"Terrorist\" 2002 GBV / Sin Sin 77 Released: 2002 Label: Devil in the Woods (#53) Format: 7-inch Single A1: Guided by Voices – \"Cheyenne\" [Live] (R. Pollard) B1: Sin Sin 77 – \"Radio\"",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Live albums",
    "title": "Guided by Voices discography: Live albums",
    "text": "Year Album details 2007 Live from Austin, TX Released: May 15, 2007 Label: New West Format: 2 CDs 2018 Ogre's Trumpet Released: March 9, 2018 Label: Guided By Voices Inc. Format: 2×LP, CD",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Box sets",
    "title": "Guided by Voices discography: Box sets",
    "text": "Year Album details 1995 Box Released: February 28, 1995 Label: Scat (#40) Format: 6 LPs, 5 CDs 2000 Suitcase: Failed Experiments and Trashed Aircraft Released: October 17, 2000 Label: Fading Captain Series (#6) Format: 4 CDs 2003 Hardcore UFOs: Revelations, Epiphanies and Fast Food in the Western Hemisphere Released: November 4, 2003 Label: Matador (OLE 550) Format: 5 CDs + 1 DVD 2005 Suitcase 2: American Superdream Wow Released: October 4, 2005 Label: Fading Captain Series (#37) Format: 4 CDs 2009 Suitcase 3: Up We Go Now Released November 3, 2009 Label: Guided By Voices Inc. (GBVI-8) Format: 4 CDs 2015 Suitcase 4: Captain Kangaroo Won the War Released November 20, 2015 Label: Guided By Voices Inc. (GBVI-65) Format: 4 CDs",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Compilation albums",
    "title": "Guided by Voices discography: Compilation albums",
    "text": "Each of the four Briefcase releases is a single LP compilation of songs selected from the associated 4-disc Suitcase box-set. Year Album details Peak chart positions USHeat. USIndie 1992 An Earful O' Wax Released: 1992 Label: Get Happy Records Format: LP — — 1993 Vampire On Titus/Propeller Released: 1993 Label: Scat Records/Matador Format: CD — — 1995 King Shit The Golden Boys Released: February 2, 1995 (reissued January 27, 2015) Label: Scat (#61) Format: LP, CD — — 2000 Briefcase (Suitcase Abridged: Drinks and Deliveries) Released: October 17, 2000 Label: Fading Captain Series (#7) Format: LP — — 2003 The Best of Guided by Voices: Human Amusements at Hourly Rates Released: November 4, 2003 Label: Matador (OLE 565) Format: CD 39 26 2005 Briefcase 2 (Suitcase 2 Abridged – The Return of Milko Waif) Released: October 4, 2005 Label: Fading Captain Series (#38) Format: LP — — 2007 Crickets: Best of the Fading Captain Series 1999–2007 Released: May 29, 2007 Label: Fading Captain Series (#44) Format: 2 CDs — — 2009 Briefcase 3: Cuddling Bozo's Octopus Released: November 3, 2009 Label: Guided By Voices Inc. (GBVI-9) Format: LP — — 2010 Metro: The Official Bootleg Series, Volume 1 Released: July 25, 2010 Format: CD — — 2013 Glue On Bicycle Released: 2013 Label: Fire Records, Guided By Voices Inc. Format: CD — — 2015 Briefcase 4: Captain Kangaroo Won the War Released: November 20, 2015 Label: Guided By Voices Inc. (GBVI-64) Format: LP — — 2022 Scalping the Guru Released: October 28, 2022 Label: Guided By Voices Inc. (GBVI-116) Format: CD, CS, LP — —",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Soundtracks",
    "title": "Guided by Voices discography: Soundtracks",
    "text": "Year Album details Track details 1996 Brain Candy Soundtrack Released: 1996 Label: Matador (OLE 183-1) Format: LP, CD #11 - \"Postal Blowfish\" [New version] (Robert Pollard, Mitch Mitchell) 1999 Buffy the Vampire Slayer: The Album Released: October 19, 1999 Label: TVT (8300) Format: CD #2 - \"Teenage FBI\" (R. Pollard) 2000 Crime and Punishment in Suburbia Soundtrack Released: August 22, 2000 Label: Milan (73138 35909-2) Format: CD #12 - \"Learning to Hunt\" (R. Pollard) 2001 Dean Quixote: The Soundtrack to the Film Released: November 20, 2001 Label: spinART (SPART 99) Format: CD #3 - \"If We Wait\" (R. Pollard) 2002 ESPN's Ultimate X: The Movie Soundtrack Released: May 14, 2002 Label: Hollywood (162340) Format: CD #5 - \"Skills Like This\" (R. Pollard) 2002 Scrubs Soundtrack Released: September 24, 2002 Label: Hollywood (162353) Format: CD #8 - \"Hold on Hope\" (R. Pollard) 2006 Beer League Soundtrack Released: September 5, 2006 Label: Lakeshore (LKS 338812) Format: CD #3 - \"Bulldog Skin\" (R. Pollard) #9 - \"Girls of Wild Strawberries\" (R. Pollard)",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Video albums",
    "title": "Guided by Voices discography: Video albums",
    "text": "Year Video details 1996 Live at the Whisky a Go Go Released: 1996 Label: Rockathon Format: VHS 1998 Watch Me Jumpstart Released: 1998 Label: Matador (OLE 284) Format: VHS 2000 The Who Went Home and Cried Released: 2000 Label: Rockathon, MVD Format: VHS, DVD 2002 Some Drinking Implied Released: October 12, 2002 Label: Rockathon Format: DVD 2003 Watch Me Jumpstart: Expanded Version Released: November 4, 2003 Label: Matador (OLE 596) Format: DVD 2005 The Electrifying Conclusion Released: November 15, 2005 Label: Plexifilm Format: DVD 2007 Live from Austin, TX Released: May 15, 2007 Label: New West Format: DVD",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Unofficial albums",
    "title": "Guided by Voices discography: Unofficial albums",
    "text": "Year Album details 1994 Crying Your Knife Away Released: 1994 Label: None/Simple Solution Records Format: LP, CD, Unofficial live album 1995 For All Good Kids Released: 1995 Label: None Format: LP, Unofficial live album N/A Live at The Embassy, London, ONT - October 26, 1995 Released: Unknown Label: None Format: CD, Unofficial live album 1996 Benefit For The Winos Released: 1996 Label: None Format: LP, CD, Unofficial live album N/A @ The Garage, London, June 21, 1996 Released: Unknown Label: None Format: Cassette, Unofficial live album 1996 Jellyfish Reflector Released: 1996 Label: None Format: LP, CD, Unofficial live album N/A The Garage, London, October 8, 1997 Released: Unknown Label: None Format: Cassette, Unofficial live album N/A Live at Bernie's, Columbus, OH - March 28, 1998 Released: Unknown Label: None Format: CD, Unofficial live album 1999 I'm Much Greater Than You Think Released: 1999 Label: None Format: CD, Unofficial live album",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-Books",
    "title": "Guided by Voices discography: Books",
    "text": "Guided by Voices: A Brief History — Twenty-One Years of Hunting Accidents in The Forests of Rock and Roll Written by James Greer and published by Grove/Atlantic in 2005, this is the first biography of GBV authorized by the band. Steven Soderbergh wrote the foreword. Author Jim Greer, a former editor of Spin magazine, was also a member of the band from 1994 to 1996 (he wrote the song \"Trendspotter Acrobat\" on Sunfish Holy Breakfast). Bee Thousand Written by Marc Woodworth and published by Continuum Books in 2006 as part of their 33⅓ series, this book is about the 1994 album Bee Thousand. The book explores the unusual production of the album, the lyrics of Robert Pollard, and the influence the album has had. Closer You Are: The Story of Robert Pollard and Guided By Voices Written by Matthew Cutter.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-References-0",
    "title": "Guided by Voices discography: References (part 1)",
    "text": "^ a b Lapierre, Megan (April 16, 2024). \"Guided by Voices Announce 'Strut of Kings,' Their Only Album of 2024\". Exclaim!. ISSN1207-6600. Retrieved April 16, 2024. ^ Since the album Tonics Twisted Chasers was originally released only to the GBV fan club, it is often not counted among the GBV studio albums. ^ \"Guided By Voices\". Discogs. Retrieved November 7, 2017. ^ \"Robert Pollard\". Gbvdb.com. Retrieved October 1, 2013. 1,101 songs credited as \"Songwriter\" + 547 as \"Co-Songwriter\" = 1,648 songs in total; 539 credited to Guided by Voices ^ a b c d e \"Artist Chart History – Guided by Voices\". Billboard.com. Nielsen Company. Retrieved September 4, 2008. ^ a b c d e \"Guided by Voices Awards\". AllMusic. Retrieved July 11, 2016. ^ Released the following year with bonus tracks. ^ a b \"Music\". Factory of Raw Essentials. Archived from the original on July 1, 2018. Retrieved June 30, 2018. ^ \"The Quietus | Reviews | Guided By Voices\". The Quietus. May 8, 2019. Retrieved May 14, 2019. ^ Rowin, Michael Joshua (February 14, 2020). \"Review: Guided by Voices's Surrender Your Poppy Field Serves Power Pop with a Twist\". Slant. Retrieved July 19, 2020. ^ Rowin, Michael Joshua (August 14, 2020). \"Review: With Mirrored Aztec, Guided by Voices Gets Back to Basics\". Slant Magazine. Retrieved September 28, 2020. ^ Schatz, Lake (October 19, 2020). \"Guided by Voices Announce Third Album of 2020, Share \"Mr. Child\": Stream\". Consequence. Retrieved December 10, 2020. ^ \"Superchunk/Guided By Voices Split",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-References-1",
    "title": "Guided by Voices discography: References (part 2)",
    "text": "\". Gbvdb.com. Retrieved September 5, 2008. ^ \"8 Rounds: GVSB vs GBV Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices Airport 5 - Selective Service Split, Bonus Tracks\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices/Jenny Mae Leffel Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices/Grifters Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices/Belreve Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices/New Radiant Storm King Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices/Cobra Verde Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices/Sin Sin 77 Split\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Live From Austin, TX Live\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Guided By Voices - An Earful O'Wax\". Discogs. October 2, 1994. Retrieved November 5, 2017. ^ \"Guided By Voices - Vampire On Titus / Propeller\". Discogs. October 2, 1993. Retrieved November 5, 2017. ^ \"Guided By Voices - Glue On Bicycle\". Discogs. Retrieved November 5, 2017. ^ \"Guided By Voices\". Discogs. Retrieved November 5, 2017. ^ a b c \"Guided By Voices: A Brief History: Twenty-One Years Of Hunting Accidents In The Forests Of Rock And Roll (By James Greer)\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Jim Greer\". Gbvdb.com. Retrieved September 5, 2008. ^ a b \"Bee Thousand (By Marc Woodworth)\". Gbvdb.com. Retrieved September 5, 2008. ^ \"Closer You Are: The Story of Robert Pollard and Guided By Voice",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-References-2",
    "title": "Guided by Voices discography: References (part 3)",
    "text": "s (By Matthew Cutter)\". Gbvdb.com. Retrieved November 29, 2020.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-Guided_by_Voices_discography-External links",
    "title": "Guided by Voices discography: External links",
    "text": "Official Guided by Voices website GBVDB – Guided by Voices Database vteGuided by Voices Robert Pollard Doug Gillard Mark Shue Bobby Bare Jr. Kevin March Tobin Sprout Greg Demos Kevin Fennell Jim Macpherson James Greer Discography Studio albums Devil Between My Toes (1987) Sandbox (1987) Self-Inflicted Aerial Nostalgia (1989) Same Place the Fly Got Smashed (1990) Propeller (1992) Vampire on Titus (1993) Bee Thousand (1994) Alien Lanes (1995) Under the Bushes Under the Stars (1996) Tonics Twisted Chasers (1996) Mag Earwhig! (1997) Do the Collapse (1999) Isolation Drills (2001) Universal Truths and Cycles (2002) Earthquake Glue (2003) Half Smiles of the Decomposed (2004) Let's Go Eat the Factory (2012) Class Clown Spots a UFO (2012) The Bears for Lunch (2012) English Little League (2013) Motivational Jumpsuit (2014) Cool Planet (2014) Please Be Honest (2016) August by Cake (2017) How Do You Spell Heaven (2017) Space Gun (2018) Zeppelin Over China (2019) Warp and Woof (2019) Sweating the Plague (2019) Surrender Your Poppy Field (2020) Mirrored Aztec (2020) Styles We Paid For (2020) Earth Man Blues (2021) It's Not Them. It Couldn't Be Them. It Is Them! (2021) Crystal Nuns Cathedral (2022) Tremblers and Goggles by Rank (2022) La La Land (2023) Welshpool Frillies (2023) Nowhere to Go but Up (2023) Strut of Kings (2024) Universe Room (2025) Thick Rich and Delicious (2025) EPs Forever Since Breakfast (1986) The Grand Hour (1993) Static Airplane Jive (1993) Get Out of My Stations (1994) Fast Japanese Spin Cycle (1994) Clown Prince of the Menthol Trailer (1994) I Am a Scientist (1994) Tigerbomb (1995) Sunfish Holy Breakfast (1996) Plantations of Pale Pink (1996) Wish in One Hand... (1997) Plugs for the Program (1999) Hold on Hope (2000) Dayton, Ohio–19 Something and 5 (2000) The Pipe Dreams of Instant Prince Whippet (2002) Down by the Racetrack (2013) Live albumsLive from Austin, TX (2007)Compilation albums The Best of Guided by Voices: Human Amusements at Hourly Rates (2003) Crickets: Best of the Fading Captain Series 1999–2007 (2007) Scalping the Guru (2022) Box sets Box (1995) Suitcase: Failed Experiments and Trashed Aircraft (2000) Hardcore UFOs: Revelations, Epiphanies and Fast Food in the Western Hemisphere (2003) Suitcase 2: American Superdream Wow (2005) Suitcase 3: Up We Go Now (2009) Suitcase 4: Captain Kangaroo Won the War (2015) Category",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Guided_by_Voices_discography"
  },
  {
    "id": "wiki-summary-Robert_Pollard",
    "title": "Robert Pollard",
    "text": "Robert Ellsworth Pollard Jr. is an American singer and songwriter. He is the frontman and leader of indie rock band Guided by Voices, of which he is also the only constant member. He has also released 22 solo albums.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Early life and education-0",
    "title": "Robert Pollard: Early life and education (part 1)",
    "text": "Pollard was born in Dayton, Ohio, where he has lived all his life. During most of his childhood and adolescence, sports were his main interest. When Pollard began to show interest in music during high school, his father tried to discourage this. Pollard attended Northridge High School in the Dayton suburb of Northridge, followed by Wright State University in Fairborn, Ohio, where he once pitched a no-hitter for the baseball team. As a teenager Pollard was in a heavy metal cover band called Anacrusis, and went to arena shows which he likens to those featured in the documentary Heavy Metal Parking Lot. Pollard has said that much of the inspiration for his songwriting has come from time spent hanging out with his high school friends from Dayton, a group he calls \"The Monument Club\". Pollard said of his teenage years: Growing up, I didn't really have any musical talent. I could always sing, but that's it. So I started hanging around with all these weirdoes from Northridge who could play guitar. And I would just watch them, 'Wow, I've got to learn how to do that.' That song 'Hank's Little Fingers' (on Devil Between My Toes) – Hank (Davidson) is the guy that inspired me to play the guitar. He had a deformed hand with these little bitty fingers. After graduating from high school in 1975, Pollard bought a guitar with his graduation money. In college, he began singing in rock bands. Although throwing a no-hitter in college, he eventually abandoned athletics realizing that he wasn't qu",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Early life and education-1",
    "title": "Robert Pollard: Early life and education (part 2)",
    "text": "ick enough to be a professional and that his character was too independent to be obedient to the strict athletic program. \"I was sick of people snapping their fingers and expecting me to move.\" When he heard the news, Pollard's father withdrew his financial support, forcing his son to get a job washing dishes. Towards the end of his senior year at Wright State University, Pollard married Kim Dowler, a home-town girl he had been dating for seven years. Dowler did not go to college herself, but started working right out of high school. After Pollard's college graduation, Dowler supported him for a little while, but he then got a job as a school teacher. It was a job with a lot of vacation time and this meant Pollard was able to pursue his music. But the job rubbed off on him, and Pollard has stated that his years as a teacher inspired songs such as \"Gold Star For Robot Boy\", \"Teenage FBI\" and \"Non-Absorbing\". Pollard has worked at all levels of primary school, from elementary school to middle school to high school. He found the most difficult assignment to be teaching physical science to junior high schoolers. Eventually he settled on teaching fourth graders. He said of his teaching years: \"I never went to the teachers' lounge. But the teachers liked me. In elementary school, there aren't a lot of male teachers, so they liked the fact I was around. They'd say, 'Why don't you come down and hang out with us in the teachers' lounge?' But I would go off and take a nap to try to get",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Early life and education-2",
    "title": "Robert Pollard: Early life and education (part 3)",
    "text": " rid of my hangover. I had 14 years of that.\"",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Career-0",
    "title": "Robert Pollard: Career (part 1)",
    "text": "Pollard performing at SXSW 2006 Beginnings Main article: Guided by Voices Pollard started playing music in local cover bands in Dayton, and got involved in a songwriters' guild, but he longed to be the leader of a band. In 1981, he began playing original songs with fellow Northridge High School alums Kevin Fennell and Mitch Mitchell. For two years they recorded in the basement of Pollard's house, and played out under a variety of names (including Instant Lovelies, Acid Ranch and Coyote Call). Then in 1983 Pollard eventually dubbed the project \"Guided by Voices\". At the time he was working part-time as an elementary school teacher. In total, Guided by Voices released 16 full-length original albums between 1987 and 2004, as well as a large number of EPs and compilations. Although known as a lo-fi band that relied on home recordings, in later years the group relied more on professional recording studios and worked with producers such as Ric Ocasek. Initially, Guided by Voices was a band in name only, its members being a revolving cast of musicians, most of whom Pollard kicked out of the band at one time or another. \"In the early days of Guided by Voices, when no one was listening, I was impatient\", Pollard wrote in 2005. \"I used to tire of people in the band very quickly. I had physical altercations with them. I even resorted to bullshit tactics, like telling the band I was quitting and we were breaking up, then forming again a month later with new members.\" To finance the band'",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Career-1",
    "title": "Robert Pollard: Career (part 2)",
    "text": "s early recordings, Pollard, his brother, and their manager obtained a loan from the Dayton Public Schools credit union. Between 1986 and 1992, they released six records in this way, recording, pressing and distributing them at their own expense. These records got very little response, and although the pressings ran only to between 300 and 1,000 copies of each, the producers were left with many copies on their hands. In 1992, bowing to the lack of support from family and friends, and to the pressure of unpaid debt, Pollard broke up Guided by Voices after releasing Propeller, which he felt was their best album to date. He then committed to teaching school full-time. However, Propeller impressed the indie label Scat Records, who signed the band to a recording contract. The result was that Guided by Voices got back together in 1993, and played a show that year at the New Music Seminar in New York City – the band's first live date in almost six years. With the release of Vampire on Titus (1993), the band was finally able to perform live around the United States. In August 2004, the band released Half Smiles of the Decomposed, which was intended to be their final album. In 2004, on New Year's Eve, Guided by Voices performed their last show at The Metro in Chicago. In 2010 the main 1990s line-up reunited for Matador Records' 21st birthday. A full tour followed and the band remained together until September 2014. Guided by Voices released its first album in seven years on January 1,",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Career-2",
    "title": "Robert Pollard: Career (part 3)",
    "text": " 2012, Let's Go Eat the Factory. On January 3, the band appeared on the Late Show with David Letterman to promote the LP. They released their second post-reunion album, Class Clown Spots a UFO, on June 11. A third album, The Bears for Lunch, came out on November 13. The fourth post-reunion album (and twentieth Guided by Voices album), English Little League, was released on April 30, 2013. Motivational Jumpsuit and Cool Planet followed in February and May 2014, respectively. In September 2014, the band announced they were disbanding once again and cancelled all remaining dates on their tour.Pollard performing in Chicago in 2006 Solo career Pollard began releasing solo records in 1996, alongside regular releases from Guided by Voices. These albums were typically recorded with a small group consisting of current or former Guided by Voices members, and they were generally considered to informally be part of the Guided by Voices canon, as that band would regularly perform selections from the solo releases in concert. After the dissolution of Guided by Voices in 2004, Robert Pollard launched his official solo career with the release of From a Compound Eye in February 2006. Pollard's recent studio work has eschewed the live-band format, instead relying on the multi-instrumental talents of Todd Tobias, who produced several Guided by Voices albums. In 2006, Pollard resumed touring with a new band informally dubbed \"The Ascended Masters\", which featured Tommy Keene on lead guitar and k",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Career-3",
    "title": "Robert Pollard: Career (part 4)",
    "text": "eyboards, Dave Phillips on guitar, Jon Wurster on drums, and Jason Narducy on bass, but subsequent to the cancellation of some 2006 dates due to a leg injury, Pollard announced his retirement from touring. Despite this, Pollard performed two shows in support of his new albums. The first show was on November 30, 2007, in Chicago at The Metro. The second was on December 1, 2007, in Newport, Kentucky (across the Ohio River from Cincinnati) at the Southgate House. After releasing Superman Was a Rocker in January, he announced that he would be leaving Merge Records to form Guided by Voices, Inc., his own record label that will produce his entire musical library. Other bands and projects Pollard has also issued recordings under a variety of other band names and in collaboration with former GBV colleagues and other musicians. In 2008, he formed a new band, Boston Spaceships, comprising Pollard, John Moen of The Decemberists and Perhapst, and Chris Slusarenko, who played in the final incarnation of Guided by Voices. The band's first album, Brown Submarine, was released on September 16, 2008, on Guided by Voices, Inc., and was followed by a tour in the fall of that year. A follow-up, The Planets Are Blasted, was released on February 17, 2009, with another album Zero to 99 released in October 2009. Our Cubehouse Still Rocks was released in September 2010. Boston Spaceships released their fifth and final album Let It Beard on August 2, 2011.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Discography-0",
    "title": "Robert Pollard: Discography (part 1)",
    "text": "See also: Guided by Voices discography Guided By Voices: 1987– Devil Between My Toes (LP) 1987- Sandbox (LP) 1989- self-Inflicted Aerial Nostalgia (LP) 1990- same place the fly got smashed (LP) 1992- Propeller (CD/LP/TAPE) 1994- Vampire On Titus (CD/LP/TAPE) 1994- Bee Thousand (CD/LP/TAPE) 1995- Alien Lanes (CD/LP/TAPE) 1996- Tonics Twisted Chasers (CD/LP) 1996- Under The Bushes, Under The Stairs (CD/LP/TAPE) 1997- Mag Earwhig! (CD/LP/TAPE) 1999- Do The Collapse (CD/LP/TAPE) 2001- Isolation Drills (CD/LP) 2002- Universal Truths And Cycles (CD/LP) 2003- Earthquake Glue (CD/LP) 2004- Half Smiles Of The Decomposed (CD/LP) 2012- Let’s Go Eat The Factory! (CD/LP) 2012- Class Clown Spots A UFO (CD/LP) 2012- The Bears For Lunch (CD/LP) 2013- English Little League (CD/LP) 2014- Motivational Jumpsuit (CD/LP) 2014- Cool Planet (CD/LP) 2016- Please Be Honest (CD/LP) 2017- August By Cake (CD/LP) 2017- How Do You Spell Heaven? (CD/LP) 2018- Space Gun (CD/LP) 2019- Zeppelin Over China (CD/2xLP) 2019- Warp And Woof (CD/LP) 2019- Sweating The Plague (CD/LP) 2020- Surrender Your Poppy Field (CD/LP) 2020- Mirrored Aztec (CD/LP) 2020- Styles We Paid For (CD/LP) 2021- Earth Man Blues (CD/LP) 2021- It’s Not Them. It Couldn’t Be Them. It Is Them (CD/LP) 2022- Crystal Nuns Cathedral (CD/LP) 2022- Tremblers And Goggles By Rank (CD/LP) 2023- La La Land (CD/LP) 2023- Welshpool Frilies (CD/LP) 2023- Nowhere To Go But Up (CD/LP) 2024- Strut Of Kings (CD/LP) 2025- Universe Room (CD/LP) 2025- Thick Rich A",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Discography-1",
    "title": "Robert Pollard: Discography (part 2)",
    "text": "nd Delicious (CD/LP) Solo studio albums: 1996– Not in My Airforce (CD/LP) 1998– Waved Out (CD/LP) 1999– Kid Marine (CD/LP) 2003– Motel of Fools (CD/LP) 2004– Fiction Man (CD/LP) 2006– From a Compound Eye (CD/2×LP) 2006– Normal Happiness (CD/LP) 2007– Standard Gargoyle Decisions (CD/LP) 2007– Coast to Coast Carpet of Love (CD/LP) 2008– Superman Was a Rocker (CD/LP) 2008– Robert Pollard Is Off to Business (CD/LP) 2009– The Crawling Distance (CD/LP) 2009– Elephant Jokes (CD/LP) 2010– We All Got Out of the Army (CD/LP) 2010– Moses on a Snail (CD/LP) 2011– Space City Kicks (CD/LP) 2011– Lord of the Birdcage (CD/LP) 2012– Mouseman Cloud (CD/LP) 2012– Jack Sells The Cow (CD/LP) 2013– Honey Locust Honky Tonk (CD/LP) 2013– Blazing Gentlemen (CD/LP) 2015– Faulty Superheroes (CD/LP) 2016– Of Course You Are (CD/LP) 2022– Our Gaze (CD/LP) Other albums/EPs: 1999– Speak Kindly of Your Volunteer Fire Department (with Doug Gillard) (CD/LP) 2001– Choreographed Man of War (titled as: \"Robert Pollard and the Soft Rock Renegades\") (CD/LP) 2002 – The Tropic of Nipples (Complete soundtrack of the Tropic of Nipples)The Tropic of Nipples 2004– Edison's Demos original demos for the songs that became Earthquake Glue (CD/LP) 2005– Music for 'Bubble' (CD EP/7\") 2005– Zoom (It Happens All Over The World) (CD EP/7\") 2005– Relaxation of the Asshole (spoken word) (LP) 2006– Moon (live CD included with original mail orders of Normal Happiness) 2007– Meet the King: Asshole 2 (LP – Yuk Yuk Motherfucker – Unoffi",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Discography-2",
    "title": "Robert Pollard: Discography (part 3)",
    "text": "cial release) 2007– Silverfish Trivia (CD/12\" EP) 2008– Weatherman and Skin Goddess (CD EP/12\") 2017 – She Laughed I Left (7-inch Single – titled as: \"Cash Rivers – She Laughed I Left\")",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Other projects-0",
    "title": "Robert Pollard: Other projects (part 1)",
    "text": "Fading Captain series During the mid-90s, in addition to GbV albums appearing annually, Pollard's prolificacy typically was vented onto innumerable singles, EPs, compilations and other side releases. However, once signed to a major label and constrained to the expectation of producing only a single album per 18 months, Pollard began the self-financed and released Fading Captain Series, a series of releases both under his own name, and a wide variety of pseudonyms. In addition to solo and archival releases, Pollard began collaborating with fellow musicians and friends by mail via a process dubbed \"postal rock\" – Pollard would receive completed musical backing tracks, and add his own lyrics and vocals. Albums under the Airport 5, Circus Devils, and Go Back Snowball monikers, among others were produced in this fashion. In December 2006, Pollard announced that the Fading Captain Series was being concluded with the release of Crickets: Best of the Fading Captain Series 1999–2007, a 50-song \"best of\" collection spanning from 1999 through 2007. The bands that used to release works in the Fading Captain Series now release records on other labels, such as The Takeovers' Bad Football coming out on Off Records and the Circus Devils' Sgt. Disco coming out on Ipecac Records. In addition the Pollard albums Kid Marine, Motel of Fools and Fiction Man were all released in the Fading Captain Series although Pollard's other solo albums were not. Acid Ranch: (archival recordings featuring Robert",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Other projects-1",
    "title": "Robert Pollard: Other projects (part 2)",
    "text": " Pollard, Kevin Fennell and Mitch Mitchell) 2002 – Some of the Magic Syrup Was Preserved (2×LP—Pollard's first double album) 2005 – As Forever: A Manifesto of Fractured Imagination And Wreckless Living 2007 – The Great Houdini Wasn't So Great Airport 5: (Robert Pollard and Tobin Sprout) 2001 – Tower in the Fountain of Sparks 2002 – Life Starts Here Circus Devils: (Robert Pollard, Todd Tobias and Tim Tobias) 2001 – Ringworm Interiors (CD/LP) 2002 – The Harold Pig Memorial (CD/LP) 2003 – Pinball Mars (CD/LP) 2005 – Five (CD/LP) 2007 – Sgt. Disco (CD/2XLP) 2008 – Ataxia (CD/LP) 2009 – Gringo (CD/LP) 2010 – Mother Skinny (CD/LP) 2011 – Capsized! (CD/LP) 2013 – When Machines Attack (CD/LP) 2013 – My Mind Has Seen the White Trick (CD/LP) 2014 – Escape (CD/LP) 2015 – Stomping Grounds (CD/LP) 2017 – Laughs Last (CD/LP) 2017 – Laughs Best (The Kids Eat It Up) (CD/LP) [anthology] 2023 - Squeeze the Needle (LP) Go Back Snowball: (Robert Pollard and Mac McCaughan) 2002 – Calling Zero Hazzard Hotrods: (Recording of informal 1990 performance by Pollard, Tobin Sprout, Mitch Mitchell, and Kevin Fennell) 2000 – Big Trouble (re-released as Bigger Trouble 2005) Howling Wolf Orchestra: (Pollard and various GbV members) 2000 – Speedtraps for the Bee Kingdom (12-inch EP/CD) Keene Brothers: (Robert Pollard and Tommy Keene) 2006 – Blues and Boogie Shoes Lexo and the Leapers: (Robert Pollard backed by The Tasties) 1999 – Ask Them (12-inch EP/CD) Lifeguards (Robert Pollard and Doug Gillard) 2003 – Mis",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Other projects-2",
    "title": "Robert Pollard: Other projects (part 3)",
    "text": "t King Urth 2011 – Waving at the Astronauts The Moping Swans (Robert Pollard, Greg Demos, Jim MacPherson and Tony Conley) 2005 – Lightninghead to Coffee Pot (12-inch EP/CD) Nightwalker (pseudonym for archival GbV recordings) 1999 – In Shop We Build Electric Chairs: Professional Music by Nightwalker 1984–1993 Phantom Tollbooth: 2003 – Beard of Lightning Psycho and the Birds: (Todd Tobias supplementing Pollard solo demos) 2006 – All That is Holy 2006 – Check Your Zoo (7-inch EP/CD) 2008 – We've Moved The Takeovers: (Robert Pollard and Chris Slusarenko) 2006 – Turn to Red 2007 – Bad Football Guided by Voices Inc. Ricked Wicky: (Kevin March, Nick Mitchell, Robert Pollard, Todd Tobias) 2015 – I Sell The Circus (LP – Guided by Voices Inc. – GBVi52) 2015 – Death Metal Kid (7-inch, Single – Guided by Voices Inc. – GBVi53) 2015 – Mobility (7-inch, Single – Guided by Voices Inc. – GBVi54) 2015 – Piss Face (7-inch, Single – Guided by Voices Inc. – GBVi55) 2015 – King Heavy Metal (LP – Guided by Voices Inc. – GBVi60) 2015 – Swimmer to a Liquid Armchair (LP – Guided by Voices Inc.) Teenage Guitar: (Robert Pollard playing all instruments) 2013 – Force Fields At Home 2014 – More Lies From The Gooseberry Bush Boston Spaceships: (Robert Pollard, Chris Slusarenko, John Moen) 2008 – Brown Submarine 2009 – The Planets Are Blasted 2009 – Zero To 99 2009 – Licking Stamps And Drinking Shitty Coffee: Live In Atlanta 2010 – Our Cubehouse Still Rocks 2011 – Let It Beard Other record labels When Pollar",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Other projects-3",
    "title": "Robert Pollard: Other projects (part 4)",
    "text": "d announced that the Fading Captain Series was being concluded he also announced that he was starting up a new record label, then called Record Company Records but later re-titled as Prom is Coming, which is named after a song off his first solo album Not in My Airforce. The first (and thus far only) release on Prom is Coming was Silverfish Trivia. In spring 2007, Pollard began a singles collection called the Happy Jack Rock Records Single Series in which one 7-inch record was released per month for 12 months starting June 22, 2007. All the records featured an A-side from Pollard's dueling Merge releases that year (Standard Gargoyle Decisions and Coast to Coast Carpet of Love) and a non-album B-side. 1,000 of each 7-inch was pressed. Pollard's album Superman Was a Rocker was the first LP released on Happy Jack Rock Records (although the vinyl version of Circus Devils' Sgt. Disco had been released on the same label in 2007). Pollard continues to release 7-inch records on the label. June 2009 will see the first release from a new Happy Jack project Cosmos, a collaboration with Richard Davies titled Jar of Jam Ton of Bricks. In 2008, Pollard announced the forming of yet another new label Guided by Voices Inc. The first album release on Guided by Voices Inc. was Robert Pollard Is Off To Business, preceded by the 12-inch EP Weatherman And Skin Goddess. Pollard's first two Boston Spaceships releases have been on Guided by Voices Inc. EAT and Town of Mirrors In the fall of 2003 Poll",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Other projects-4",
    "title": "Robert Pollard: Other projects (part 5)",
    "text": "ard released EAT, a literary magazine consisting of original poems and collages by Pollard. As of 2023 EAT is on its eighteenth issue. Pollard's collage art is featured on many Guided by Voices albums (notable exceptions being the two released on TVT Records). In 2008, Pollard's collages were collected and published in Town of Mirrors: The Reassembled Imagery of Robert Pollard. Town of Mirrors features Pollard's visual art and lyrics/poetry. There are over 175 collages, 20 of which were created specifically for the book's release.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Personal life",
    "title": "Robert Pollard: Personal life",
    "text": "Pollard and his daughter in 2012 Pollard had two children with Kim Dowler. He wrote a song about each: \"Your Name is Wild\" about his daughter Erika and \"My Son Cool\" being about his son Bryan. However, the success of Guided by Voices in the mid 1990s coincided with the breakdown of their marriage. In 2007 Pollard married Sarah Zade. The couple currently lives in Dayton, Ohio. \"I've never considered myself to be a runaway success at anything I've done, including parenthood\", Pollard wrote in 2005. \"But I've at least allowed my children to pursue their own interests without too much interference, and I think they both turned out pretty good.\"",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Honors and awards",
    "title": "Robert Pollard: Honors and awards",
    "text": "2010: Northridge High School, Northridge Athletic Hall of Fame, Class of 2010 – with his brother Jim Pollard",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Works and publications",
    "title": "Robert Pollard: Works and publications",
    "text": "Books Pollard, Robert (words and pictures by); Moody, Rick (introduction by) (2008). Reynolds, Eric (ed.). Town of Mirrors: The Reassembled Imagery of Robert Pollard. Seattle, WA: Fantagraphics Books. ISBN978-1-56097-924-1. OCLC181140114. Pollard, Robert (2017). 100 (aka Robert Pollard 100). Dayton, OH: Guided By Voices Inc. / Rockathon Records. – includes 100 front and back covers of Pollard's studio albums Pollard, Robert (2025). Eat 21. Dayton, OH: Guided By Voices Inc. / Rockathon Records. Pollard, Robert (2024). Eat 20. Dayton, OH: Guided By Voices Inc. / Rockathon Records. Articles Pollard, Robert (May–June 2005). \"Life Lessons from Robert Pollard: Wisdom from the man who brought you Guided By Voices\". Utne Reader.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-Further reading",
    "title": "Robert Pollard: Further reading",
    "text": "Cutter, Matthew (2018). Closer You Are: The Story of Robert Pollard and Guided by Voices. New York, NY: Da Capo. ISBN978-0-306-82577-4. OCLC1048922765. Greer, James (2005). Guided by Voices: A Brief History: Twenty-One Years of Hunting Accidents in the Forests of Rock and Roll. New York: Black Cat/Grove. ISBN 0802170137.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-References",
    "title": "Robert Pollard: References",
    "text": "^ a b \"Songwriter/Composer: Pollard Robert E Jr, Current Affiliation: BMI CAE/IPI #: 18581704\". BMI. ^ \"Nude as the News\". August 8, 2010. Archived from the original on August 8, 2010. Retrieved August 23, 2016.{{cite web}}: CS1 maint: bot: original URL status unknown (link) ^ \"Paste's 100 Best Living Songwriters: The List\". Pastemagazine.com. June 8, 2006. Retrieved August 23, 2016. ^ \"Top News, Latest headlines, Latest News, World News U.S News\". Upi.com. Retrieved August 23, 2016.permanent dead link ^ a b c d e f g h i j k l m Eric T. Miller (January 5, 1996), \"Robert Pollard, Who Are You?\", Magnet, accessed August 23, 2016. ^ Dave McKenna, Celebrating Robert Pollard’s No-Hitter And The Rock-Jock Nexus, Defector, May 14, 2023. ^ Jeff Johnson, interview with Robert Pollard, Vice, September 30, 2008 (accessed August 23, 2016). ^ \"erasing clouds book review: gbv a brief history\". Erasingclouds.com. Retrieved August 23, 2016. ^ \"Robert Pollard talks college no-hitter\". Espn.com. January 31, 2014. Retrieved March 11, 2019. ^ James Greer, Guided by Voices: A Brief History: Twenty-One Years of Hunting Accidents in the Forests of Rock and Roll. ^ a b Pollard, Robert (May–June 2005). \"Life Lessons from Robert Pollard: Wisdom from the man who brought you Guided By Voices\". Utne Reader. ^ Robinson, Amelia (December 16, 2011). \"Seen and Overheard\". Daytondailynews.com. Archived from the original on January 8, 2016. Retrieved August 23, 2012. ^ Grow, Kory (September 18, 2014). \"Guided by Voices Break Up\". Rolling Stone. ^ \"Done With Touring, Pollard Preps Seven New Albums\". Billboard.com. Retrieved August 23, 2016. ^ Robert pollard at Discogs ^ a b \"Robert Pollard Plans Seven Albums, New Label\". Archived from the original on January 25, 2007. ^ \"Ricked Wicky\". Discogs.com. Retrieved August 23, 2016. ^ \"Pollard Preps Self-Released EP, LPs for Merge, Ipecac Pitchfork\". Archived from the original on February 16, 2007. ^ \"GBVDB – Guided By Voices Database\". Gbvdb.com. Retrieved August 23, 2016. ^ \"Rockathon Books\". Rockathon. Archived from the original on October 10, 2007. Retrieved October 15, 2023. ^ Pollard, Robert (words and pictures by); Moody, Rick (introduction by) (2008). Reynolds, Eric (ed.). Town of Mirrors: The Reassembled Imagery of Robert Pollard. Seattle, WA: Fantagraphics Books. ISBN978-1-56097-924-1. OCLC181140114. ^ \"Guided By Voices\". Avclub.com. ^ \"MAGNET Interview: Robert Pollard\". Archived from the original on December 22, 2007. ^ \"Northridge High School Athletic Hall of Fame\". Northridge Alumni Bear Facts. Retrieved August 17, 2019. ^ Zezzo, Mickey (April 2, 2010). \"Northridge launches hall of fame\". Dayton Daily News.",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-External links-0",
    "title": "Robert Pollard: External links (part 1)",
    "text": "Wikimedia Commons has media related to Robert Pollard. Rockathon Records Robert Pollard Art Archived August 17, 2019, at the Wayback Machine Robert Pollard at IMDb Man With Emission: Are Robert Pollard and his spend-happy collector fans sowing ecological catastrophe? (Washington City Paper) Circus Devils – Gringo – Album Review at Citizen Dick vteRobert PollardSolo albums Not in My Airforce (1996) Waved Out (1998) Kid Marine (1999) In Shop We Build Electric Chairs: Professional Music by Nightwalker 1984–1993 (1999, as Nightwalker) Motel of Fools (2003) Fiction Man (2004) Relaxation of the Asshole (2005) From a Compound Eye (2006) Normal Happiness (2006) Silverfish Trivia (2007) Standard Gargoyle Decisions (2007) Coast to Coast Carpet of Love (2007) Superman Was a Rocker (2008) Weatherman and Skin Goddess (2008) Robert Pollard Is Off to Business (2008) The Crawling Distance (2009) Elephant Jokes (2009) We All Got Out of the Army (2010) Moses on a Snail (2010) Space City Kicks (2011) Lord of the Birdcage (2011) Mouseman Cloud (2012) Jack Sells the Cow (2012) Honey Locust Honky Tonk (2013) Blazing Gentlemen (2013) Faulty Superheroes (2015) Of Course You Are (2016) Collaboration albums Big Trouble (2000) Choreographed Man of War (2001) Calling Zero (2002) Blues and Boogie Shoes (2006) With Doug Gillard Speak Kindly of Your Volunteer Fire Department (1999) Mist King Urth (2003) Waving at the Astronauts (2011; as Lifeguards) Airport 5 albums Tower in the Fountain of Sparks (2001) L",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-External links-1",
    "title": "Robert Pollard: External links (part 2)",
    "text": "ife Starts Here (2002) Teenage Guitar albums Force Fields At Home (2013) More Lies From The Gooseberry Bush (2014) Related artists Guided by Voices Circus Devils Boston Spaceships vteGuided by Voices Robert Pollard Doug Gillard Mark Shue Bobby Bare Jr. Kevin March Tobin Sprout Greg Demos Kevin Fennell Jim Macpherson James Greer Discography Studio albums Devil Between My Toes (1987) Sandbox (1987) Self-Inflicted Aerial Nostalgia (1989) Same Place the Fly Got Smashed (1990) Propeller (1992) Vampire on Titus (1993) Bee Thousand (1994) Alien Lanes (1995) Under the Bushes Under the Stars (1996) Tonics Twisted Chasers (1996) Mag Earwhig! (1997) Do the Collapse (1999) Isolation Drills (2001) Universal Truths and Cycles (2002) Earthquake Glue (2003) Half Smiles of the Decomposed (2004) Let's Go Eat the Factory (2012) Class Clown Spots a UFO (2012) The Bears for Lunch (2012) English Little League (2013) Motivational Jumpsuit (2014) Cool Planet (2014) Please Be Honest (2016) August by Cake (2017) How Do You Spell Heaven (2017) Space Gun (2018) Zeppelin Over China (2019) Warp and Woof (2019) Sweating the Plague (2019) Surrender Your Poppy Field (2020) Mirrored Aztec (2020) Styles We Paid For (2020) Earth Man Blues (2021) It's Not Them. It Couldn't Be Them. It Is Them! (2021) Crystal Nuns Cathedral (2022) Tremblers and Goggles by Rank (2022) La La Land (2023) Welshpool Frillies (2023) Nowhere to Go but Up (2023) Strut of Kings (2024) Universe Room (2025) Thick Rich and Delicious (2025) E",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-External links-2",
    "title": "Robert Pollard: External links (part 3)",
    "text": "Ps Forever Since Breakfast (1986) The Grand Hour (1993) Static Airplane Jive (1993) Get Out of My Stations (1994) Fast Japanese Spin Cycle (1994) Clown Prince of the Menthol Trailer (1994) I Am a Scientist (1994) Tigerbomb (1995) Sunfish Holy Breakfast (1996) Plantations of Pale Pink (1996) Wish in One Hand... (1997) Plugs for the Program (1999) Hold on Hope (2000) Dayton, Ohio–19 Something and 5 (2000) The Pipe Dreams of Instant Prince Whippet (2002) Down by the Racetrack (2013) Live albumsLive from Austin, TX (2007)Compilation albums The Best of Guided by Voices: Human Amusements at Hourly Rates (2003) Crickets: Best of the Fading Captain Series 1999–2007 (2007) Scalping the Guru (2022) Box sets Box (1995) Suitcase: Failed Experiments and Trashed Aircraft (2000) Hardcore UFOs: Revelations, Epiphanies and Fast Food in the Western Hemisphere (2003) Suitcase 2: American Superdream Wow (2005) Suitcase 3: Up We Go Now (2009) Suitcase 4: Captain Kangaroo Won the War (2015) Category vteCircus Devils Robert Pollard Todd Tobias Tim Tobias Studio albums Ringworm Interiors (2001) The Harold Pig Memorial (2002) Pinball Mars (2004) Five (2005) Sgt. Disco (2007) Ataxia (2008) Gringo (2009) Mother Skinny (2010) When Machines Attack (2013) vteBoston Spaceships Robert Pollard Chris Slusarenko John Moen Studio albums Brown Submarine (2008) The Planets are Blasted (2009) Zero to 99 (2009) Our Cubehouse Still Rocks (2010) Let It Beard (2011) Authority control databases InternationalISNIVIAFGND",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  },
  {
    "id": "wiki-Robert_Pollard-External links-3",
    "title": "Robert Pollard: External links (part 4)",
    "text": "FASTWorldCatNationalUnited StatesFranceBnF dataSpainArtistsMusicBrainzPeopleDeutsche BiographieOtherYale LUX",
    "sourceLabel": "Wikipedia",
    "sourceUrl": "https://en.wikipedia.org/wiki/Robert_Pollard"
  }
]